# 1 - Configuration globale des routeurs Core

1. On ouvre la topologie dans GNS3, on défini le hostname sur les routers R1, R2 et R3: En mode configuration (conf t), ensuite le hostname (hostname R1, hostname R2,...)

   On défini également le nom de domaine (ip domain-name LAB.tripod)

   On créé également une clé RSA (crypto key generate rsa) sur 2048 bits. Cela permettra d'activer la version 2 de ssh plus tard.

2. Toujours en mode configuration, on défini le mot de passe testtest (enable secret testtest)

3. En mode configuration on défini le user root avec le mot de passe testtest (username root secret testtest)

4. On active ssh version 2 (ip ssh version 2)

On active sshV2 uniquement sur les lignes VTY:

```
R1(config)#line vty 0 4
R1(config-line)#transport input ssh
R1(config-line)#login local
```

=> On pense à sauvegarder la configuration sur les 3 routeurs avec la commande wr

### 2 - Vérifier, activer et configurer les interfaces IPv4

1.Avec la commande #sh ip interface brief
=> le status des interfaces est "administratively down"

2.Sur R1 on configure les interfaces en ipV4, en mode de configuration:

R1(config)#int g0/0
R1(config-if)#no shutdown
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#exit

R1(config)#int g0/2
R1(config-if)#no shutdown
R1(config-if)#ip address 192.168.225.1 255.255.255.0
R1(config-if)#exit

R1(config)#int g0/3
R1(config-if)#no shutdown
R1(config-if)#ip address 192.168.226.1 255.255.255.0
R1(config-if)#exit

R1(config)#int g0/1
R1(config-if)#no shutdown
R1(config-if)#ip address dhcp
R1(config-if)#access-list 1 permit 192.168.1.0 0.0.0.255
R1(config-if)#exit

On pense à sauvegarder la configuration et on note sur R1:
GigabitEthernet0/0         192.168.1.1     YES NVRAM  up                    up
GigabitEthernet0/1         192.168.122.97  YES DHCP   up                    up
GigabitEthernet0/2         192.168.225.1   YES NVRAM  up                    up
GigabitEthernet0/3         192.168.226.1   YES NVRAM  up                    up

2.De même sur R2:

R2(config)#int g0/0
R2(config-if)#no shutdown
R2(config-if)#ip address 192.168.33.1 255.255.255.0
R2(config-if)#exit

R2(config)#int g0/1
R2(config-if)#no shutdown
R2(config-if)#ip address 192.168.225.2 255.255.255.0
R2(config-if)#exit

R2(config)#int g0/3
R2(config-if)#no shutdown
R2(config-if)#ip address 192.168.227.1 255.255.255.0
R2(config-if)#exit

Soit:
GigabitEthernet0/0         192.168.33.1    YES manual up                    up
GigabitEthernet0/1         192.168.225.2   YES manual up                    up
GigabitEthernet0/2         unassigned      YES unset  administratively down down
GigabitEthernet0/3         192.168.227.1   YES manual up                    up

3.Sur R3:

R3(config)#int g0/0
R3(config-if)#no shutdown
R3(config-if)#ip address 192.168.65.1 255.255.255.0
R3(config-if)#exit

R3(config)#int g0/1
R3(config-if)#no shutdown
R3(config-if)#ip address 192.168.226.2 255.255.255.0
R3(config-if)#exit

R3(config)#int g0/2
R3(config-if)#no shutdown
R3(config-if)#ip address 192.168.227.2 255.255.255.0
R3(config-if)#exit

Soit:
GigabitEthernet0/0         192.168.65.1    YES manual up                    up
GigabitEthernet0/1         192.168.226.2   YES manual up                    up
GigabitEthernet0/2         192.168.227.2   YES manual up                    up

5.Les interfaces sont à l'état "up" grâce à la commande "no shutdown"

6.On utilise la commande ping,
De R1 vers R2:

R1#ping 192.168.225.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.225.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms

De R1 vers R3:

R1#ping 192.168.226.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.226.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms

De R2 vers R3:

R2#ping 192.168.227.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.227.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms

7.CDP est activé par défaut:

R1#show cdp
Global CDP information:
        Sending CDP packets every 60 seconds
        Sending a holdtime value of 180 seconds
        Sending CDPv2 advertisements is  enabled

On notera que des annonces CDP sont envoyées toutes les 60s (device ID, version d'ios, type de plateforme, adresses,...)

8.Avec la commande:

R1#show cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone,
                  D - Remote, C - CVTA, M - Two-port Mac Relay

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R1.lan1          Gig 0/1           143              R B             Gig 0/1
R1.lan           Gig 0/1           174              R B             Gig 0/1
R1.lan           Gig 0/1           143              R B             Gig 0/1
R1.lan           Gig 0/1           177              R B             Gig 0/1
R1.lan           Gig 0/1           175              R B             Gig 0/1
R1.lan           Gig 0/1           171              R B             Gig 0/1
R3.LAB.tripod    Gig 0/3           167              R B             Gig 0/1
R2.LAB.tripod    Gig 0/2           134              R B             Gig 0/1
R1               Gig 0/1           44               R B             Gig 0/1
R1               Gig 0/1           64               R B             Gig 0/1
R1               Gig 0/1           158              R B             Gig 0/1
R1               Gig 0/1           131              R B             Gig 0/1

Egalement avec R1#show cdp neighbors details (trop long à copier ici)


          3. Activer DHCP pour IPv4
       
1.Sur R1 on défini les dhcp pool LANR1, LANR2 et LANR3

R1(config)#ip dhcp pool LANR1
R1(dhcp-config)#network 192.168.1.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.1.1
R1(dhcp-config)#dns-server 1.1.1.1

R1(config)#ip dhcp pool LANR2
R1(dhcp-config)#network 192.168.33.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.33.1
R1(dhcp-config)#dns-server 1.1.1.1

R1(config)#ip dhcp pool LANR3
R1(dhcp-config)#network 192.168.65.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.65.1
R1(dhcp-config)#dns-server 1.1.1.1

2.Pour exclure les 100 premières adresses:

R1(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.99
R1(config)#ip dhcp excluded-address 192.168.33.1 192.168.33.99
R1(config)#ip dhcp excluded-address 192.168.65.1 192.168.65.99

3.Pour configurer R2 et R3 en DHCP relay avec la commande "ip helper-address":

R2(config)#int g0/0
R2(config-if)#ip helper-address 192.168.1.1

R3(config)#int g0/0
R3(config-if)#ip helper-address 192.168.1.1


          4. Configurer et activer le routage OSPFv2

1. à 5. On active le protocole OSPFv2 avec l'ID 1 et le reste de la configuration:

R1(config)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#passive-interface g0/0
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
R1(config-router)#network 192.168.225.0 0.0.0.255 area 0
R1(config-router)#network 192.168.226.0 0.0.0.255 area 0
R1(config-router)#auto-cost reference-bandwidth 10000

De même sur R2:

R2(config)#router ospf 1
R2(config-router)#router-id 2.2.2.2
R2(config-router)#passive-interface g0/0
R2(config-router)#network 192.168.33.0 0.0.0.255 area 0
R2(config-router)#network 192.168.225.0 0.0.0.255 area 0
R2(config-router)#network 192.168.227.0 0.0.0.255 area 0
R2(config-router)#auto-cost reference-bandwidth 10000

Sur R3:

R3(config)#router ospf 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#passive-interface g0/0
R3(config-router)#network 192.168.65.0 0.0.0.255 area 0
R3(config-router)#network 192.168.226.0 0.0.0.255 area 0
R3(config-router)#network 192.168.227.0 0.0.0.255 area 0
R3(config-router)#auto-cost reference-bandwidth 10000

On pense à sauvegarder la configuration sur les 3 routeurs

La commande passive-interface permet d'éviter la diffusion d'annonce sur le réseaux, limitant ainsi la bande passante.

6.On vérifie la configuration OSPFv2:

R1(config)#do sh ip route ospf

7.Comme les routeurs ont tous le même niveau de priorité, l'id le plus élevé est DR et le suivant BDR
R3 est DR
R2 est BDR

8.Avec la commande "sh ip route" sur chaques routeurs on remarque:

R1:

C        192.168.1.0/24 is directly connected, GigabitEthernet0/0
L        192.168.1.1/32 is directly connected, GigabitEthernet0/0
O     192.168.33.0/24 [110/2] via 192.168.225.2, 00:09:21, GigabitEthernet0/2
O     192.168.65.0/24 [110/2] via 192.168.226.2, 00:09:11, GigabitEthernet0/3
      192.168.122.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.122.0/24 is directly connected, GigabitEthernet0/1
L        192.168.122.97/32 is directly connected, GigabitEthernet0/1
      192.168.225.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.225.0/24 is directly connected, GigabitEthernet0/2
L        192.168.225.1/32 is directly connected, GigabitEthernet0/2
      192.168.226.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.226.0/24 is directly connected, GigabitEthernet0/3
L        192.168.226.1/32 is directly connected, GigabitEthernet0/3
O     192.168.227.0/24 [110/2] via 192.168.226.2, 00:09:11, GigabitEthernet0/3
                       [110/2] via 192.168.225.2, 00:09:21, GigabitEthernet0/2


R2:
O     192.168.1.0/24 [110/2] via 192.168.225.1, 00:10:20, GigabitEthernet0/1
      192.168.33.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.33.0/24 is directly connected, GigabitEthernet0/0
L        192.168.33.1/32 is directly connected, GigabitEthernet0/0
O     192.168.65.0/24 [110/2] via 192.168.227.2, 00:10:10, GigabitEthernet0/3
      192.168.225.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.225.0/24 is directly connected, GigabitEthernet0/1
L        192.168.225.2/32 is directly connected, GigabitEthernet0/1
O     192.168.226.0/24 [110/2] via 192.168.227.2, 00:10:10, GigabitEthernet0/3
                       [110/2] via 192.168.225.1, 00:10:20, GigabitEthernet0/1
      192.168.227.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.227.0/24 is directly connected, GigabitEthernet0/3
L        192.168.227.1/32 is directly connected, GigabitEthernet0/3


R3:
O     192.168.1.0/24 [110/2] via 192.168.226.1, 00:09:52, GigabitEthernet0/1
O     192.168.33.0/24 [110/2] via 192.168.227.1, 00:09:52, GigabitEthernet0/2
      192.168.65.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.65.0/24 is directly connected, GigabitEthernet0/0
L        192.168.65.1/32 is directly connected, GigabitEthernet0/0
O     192.168.225.0/24 [110/2] via 192.168.227.1, 00:09:52, GigabitEthernet0/2
                       [110/2] via 192.168.226.1, 00:09:52, GigabitEthernet0/1
      192.168.226.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.226.0/24 is directly connected, GigabitEthernet0/1
L        192.168.226.2/32 is directly connected, GigabitEthernet0/1
      192.168.227.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.227.0/24 is directly connected, GigabitEthernet0/2
L        192.168.227.2/32 is directly connected, GigabitEthernet0/2

9.On peut faire des commandes ping pour tester la connectivité

On démarre les PC1 PC2 et PC3, on laisse DHCP leurs attribuer une adresse ipv4 => avec la commande ip dhcp

PC1> ip dhcp
DDORA
IP 192.168.1.100/24

PC2> ip dhcp
DDORA 
IP 192.168.33.100/24

PC3> ip dhcp
DDORA 
IP 192.168.65.100/24

Depuis PC2 on ping PC3 et PC1:

PC2> ping 192.168.65.100
84 bytes from 192.168.65.100 icmp_seq=3 ttl=62 time=2.236 ms
PC2> ping 192.168.1.100
84 bytes from 192.168.1.100 icmp_seq=1 ttl=62 time=2.482 ms

Depuis PC3 on ping PC1 et PC2:

PC3> ping 192.168.33.100
84 bytes from 192.168.33.100 icmp_seq=1 ttl=62 time=2.663 ms
PC3> ping 192.168.1.100
84 bytes from 192.168.1.100 icmp_seq=2 ttl=62 time=3.491 ms

Idem depuis PC1...



          5.  Activer les interfaces et le routage IPv6
          
1.On défini les adresse link local (FE80::...)

Sur R1:

R1(config)#int g0/0
R1(config-if)#ipv6 address FE80::1 link-local
R1(config-if)#exit
R1(config)#int g0/2
R1(config-if)#ipv6 address FE80::1 link-local
R1(config-if)#exit
R1(config)#int g0/3
R1(config-if)#ipv6 address FE80::1 link-local
R1(config-if)#exit

Sur R2:

R2(config)#int g0/0
R2(config-if)#ipv6 address FE80::2 link-local
R2(config-if)#exit
R2(config)#int g0/1
R2(config-if)#ipv6 address FE80::2 link-local
R2(config-if)#exit
R2(config)#int g0/3
R2(config-if)#ipv6 address FE80::2 link-local
R2(config-if)#exit

Sur R3:

R3(config)#int g0/0
R3(config-if)#ipv6 address FE80::3 link-local
R3(config-if)#exit
R3(config)#int g0/1
R3(config-if)#ipv6 address FE80::3 link-local
R3(config-if)#exit
R3(config)#int g0/2
R3(config-if)#ipv6 address FE80::3 link-local
R3(config-if)#exit

2.Pour les adresses ULA

Sur R1:

R1(config)#int g0/0
R1(config-if)#ipv6 address FD00:FD00:FD00:1::1/64
R1(config-if)#exit

Sur R2:

R2(config)#int g0/0
R2(config-if)#ipv6 address FD00:FD00:FD00:2::1/64
R2(config-if)#exit

Sur R3:

R3(config)#int g0/0
R3(config-if)#ipv6 address FD00:FD00:FD00:3::1/64
R3(config-if)#exit

3.Sur chaques routeurs:

R1(config)#ipv6 unicast-routing

R2(config)#ipv6 unicast-routing

R3(config)#ipv6 unicast-routing

On peut vérifier sur chaques routeur la configuration des interfaces en ipv6 avec "sh ipv6 int brief"


          6. Configurer et activer le routage OSPFv3

1. Sur R1:

R1(config)#int g0/0
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#exit
R1(config)#int g0/2
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#exit
R1(config)#int g0/3
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#exit

Sur R2:

R2(config)#int g0/0
R2(config-if)#ipv6 ospf 1 area 0
R2(config-if)#exit
R2(config)#int g0/1
R2(config-if)#ipv6 ospf 1 area 0
R2(config-if)#exit
R2(config)#int g0/3
R2(config-if)#ipv6 ospf 1 area 0
R2(config-if)#exit


Sur R3:

R3(config)#int g0/0
R3(config-if)#ipv6 ospf 1 area 0
R3(config-if)#exit
R3(config)#int g0/1
R3(config-if)#ipv6 ospf 1 area 0
R3(config-if)#exit
R3(config)#int g0/2
R3(config-if)#ipv6 ospf 1 area 0
R3(config-if)#exit



          7. Activer et configurer de la connectivité IPv4 publique
          
1.Sur R1:

R1(config)#int g0/1
R1(config)#no shutdown
R1(config-if)#ip add
R1(config-if)#ip address dhcp
R1(config-if)#access-list 1 permit 192.168.1.0 0.0.0.255
R1(config-if)#access-list 1 permit 192.168.33.0 0.0.0.255
R1(config-if)#access-list 1 permit 192.168.65.0 0.0.0.255
R1(config-if)#ip nat inside source list 1 interface g0/1 overload
R1(config-if)#router ospf 1
R3(config-router)#default-information originate


2. Sur R1:

R1(config)#int g0/0
R1(config-if)#ip nat inside
R1(config-if)#exit
R1(config)#int g0/2
R1(config-if)#ip nat inside
R1(config-if)#exit
R1(config)#int g0/3
R1(config-if)#ip nat inside
R1(config-if)#exit
R1(config)#int g0/1
R1(config-if)#ip nat outside
R1(config-if)#exit


